{
  "Auth": {
    "Register": {
      "Success": "Đăng ký tài khoản thành công.",
      "EmailSent": "Chúng tôi đã gửi một email xác nhận đến địa chỉ email của bạn."
    },
    "Login": {
      "Success": "Đăng nhập thành công.",
      "2FARequired": "Yêu cầu xác thực hai yếu tố. Vui lòng xác minh.",
      "DeviceVerificationRequired": "Thiết bị mới cần được xác minh. Vui lòng kiểm tra email của bạn.",
      "DeviceVerificationOtpRequired": "Thiết bị không tin cậy. Mã OTP đã được gửi đến email của bạn để xác minh."
    },
    "Logout": {
      "Success": "Đăng xuất thành công.",
      "Processed": "Đăng xuất đã được xử lý. Cookies đã được xóa."
    },
    "Password": {
      "ResetEmailSent": "Chúng tôi đã gửi hướng dẫn đặt lại mật khẩu đến email của bạn.",
      "ResetSuccess": "Mật khẩu của bạn đã được đặt lại thành công. Vui lòng đăng nhập bằng mật khẩu mới.",
      "ChangeSuccess": "Mật khẩu của bạn đã được thay đổi thành công."
    },
    "Token": {
      "Refreshed": "Token đã được làm mới thành công."
    },
    "RememberMe": {
      "Set": "Tùy chọn ghi nhớ đăng nhập đã được cập nhật."
    },
    "Google": {
      "UrlGeneratedSuccess": "Đã tạo URL xác thực Google thành công.",
      "LoginSuccess": "Đăng nhập bằng Google thành công.",
      "SuccessProceedToSecurityChecks": "Xác thực Google thành công. Đang chuyển đến kiểm tra bảo mật.",
      "LinkSuccess": "Tài khoản Google đã được liên kết thành công.",
      "LinkCancelled": "Đã hủy liên kết tài khoản Google.",
      "AccountNeedsLinking": "Email này đã được sử dụng. Vui lòng liên kết tài khoản Google với tài khoản hiện có.",
      "ConfirmLinkDetailsMessage": "Bạn sắp liên kết tài khoản Google ({googleEmail}) với tài khoản Shopsifu hiện có ({email}). Tiếp tục?",
      "Link": {
        "CancelledSuccessfully": "Yêu cầu liên kết tài khoản Google đang chờ đã được hủy.",
        "NoPendingStateToCancel": "Không tìm thấy yêu cầu liên kết tài khoản Google nào đang chờ để hủy."
      }
    },
    "Session": {
      "FetchSuccess": "Lấy danh sách phiên đăng nhập thành công."
    },
    "Otp": {
      "SentSuccessfully": "Mã OTP đã được gửi thành công đến email của bạn."
    },
    "2FA": {
      "Verify": {
        "AskToTrustDevice": "Xác minh 2FA thành công. Bạn có muốn tin cậy thiết bị này không?"
      }
    },
    "Core": {
      "Success": {
        "InitiateRegistration": "Yêu cầu đăng ký đã được bắt đầu thành công. Vui lòng kiểm tra email để tiếp tục.",
        "CompleteRegistration": "Đăng ký tài khoản thành công. Chào mừng bạn!",
        "Login": "Đăng nhập thành công. Chào mừng trở lại!",
        "RefreshToken": "Token đã được làm mới thành công.",
        "Logout": "Đăng xuất thành công. Hẹn gặp lại!"
      }
    },
    "Error": {
      "User": {
        "EmailNotFound": "Không tìm thấy tài khoản với email này.",
        "EmailAlreadyExists": "Địa chỉ email này đã được đăng ký.",
        "PhoneNumberAlreadyExists": "Số điện thoại này đã được sử dụng.",
        "UsernameAlreadyExists": "Tên người dùng '{username}' đã được sử dụng.",
        "InvalidPassword": "Mật khẩu không hợp lệ.",
        "AccountLocked": "Tài khoản đã bị khóa. Vui lòng liên hệ hỗ trợ.",
        "AccountNotActive": "Tài khoản chưa được kích hoạt."
      },
      "Token": {
        "InvalidAccessToken": "Access token không hợp lệ.",
        "InvalidRefreshToken": "Refresh token không hợp lệ hoặc đã được sử dụng.",
        "MissingRefreshToken": "Thiếu refresh token.",
        "MissingAccessToken": "Thiếu access token.",
        "AccessTokenExpired": "Access token đã hết hạn.",
        "RefreshTokenExpired": "Refresh token đã hết hạn.",
        "RefreshTokenAlreadyUsed": "Refresh token đã được sử dụng."
      },
      "Otp": {
        "Invalid": "Mã OTP không hợp lệ.",
        "Expired": "Mã OTP đã hết hạn.",
        "TooManyAttempts": "Bạn đã nhập sai OTP quá nhiều lần. Vui lòng chờ 1 phút và đăng nhập lại.",
        "FailedToSend": "Không thể gửi mã OTP.",
        "PasswordResetNotVerified": "OTP để đặt lại mật khẩu chưa được xác minh. Vui lòng xác minh OTP trước."
      },
      "SLT": {
        "CookieMissing": "Không tìm thấy cookie yêu cầu. Vui lòng thử lại.",
        "Expired": "Phiên yêu cầu đã hết hạn. Vui lòng thử lại quy trình từ đầu.",
        "Invalid": "Token tạm thời không hợp lệ.",
        "InvalidPurpose": "Mục đích của yêu cầu không hợp lệ.",
        "EmailMissingInContext": "Không tìm thấy email trong ngữ cảnh yêu cầu. Vui lòng thử lại.",
        "AlreadyUsed": "Yêu cầu này đã được xử lý hoặc đã hết hạn. Vui lòng thử lại.",
        "TooManyAttempts": "Bạn đã thử quá nhiều lần. Vui lòng thử lại sau."
      },
      "2FA": {
        "AlreadyEnabled": "Xác thực hai yếu tố đã được kích hoạt cho tài khoản này.",
        "NotEnabled": "Xác thực hai yếu tố chưa được kích hoạt cho tài khoản này.",
        "InvalidTOTP": "Mã xác thực hai yếu tố không hợp lệ.",
        "InvalidRecoveryCode": "Mã khôi phục không hợp lệ.",
        "InvalidVerificationMethod": "Phương thức xác minh không hợp lệ được cung cấp.",
        "TooManyAttempts": "Bạn đã nhập sai mã xác thực hai yếu tố quá nhiều lần. Vui lòng chờ 1 phút và thử lại.",
        "Disable": {
          "Success": "Xác thực hai yếu tố đã được tắt thành công.",
          "Failed": "Xác thực hai yếu tố đã được tắt thất bại. Vui lòng thử lại."
        },
        "Confirm": {
          "Success": "2FA đã được xác nhận và kích hoạt. Vui lòng lưu lại các mã khôi phục của bạn."
        },
        "Verify": {
          "Success": "Xác minh 2FA thành công."
        },
        "Setup": {
          "Success": "Thiết lập 2FA thành công. Bạn hãy lưu lại các mã khôi phục của bạn ở nơi an toàn."
        },
        "RecoveryCodesRegenerated": "Mã khôi phục mới đã được tạo thành công."
      },
      "Session": {
        "RevokedRemotely": "Phiên của bạn đã bị thu hồi từ một thiết bị khác. Vui lòng đăng nhập lại.",
        "NotFound": "Phiên không tồn tại hoặc đã bị thu hồi.",
        "CannotRevokeCurrent": "Bạn không thể thu hồi phiên hoạt động hiện tại của mình. Vui lòng sử dụng chức năng đăng xuất.",
        "MissingSessionIdInToken": "Thiếu định danh phiên trong token. Không thể hoàn thành hành động.",
        "InsufficientDataForRevocation": "Không đủ dữ liệu được cung cấp để thu hồi phiên hoặc thiết bị."
      },
      "Device": {
        "NotFound": "Không tìm thấy thiết bị.",
        "NotOwnedByUser": "Bạn không có quyền truy cập thiết bị này.",
        "ProcessingFailed": "Không thể xử lý thông tin thiết bị. Vui lòng thử lại hoặc liên hệ hỗ trợ.",
        "MissingInformation": "Thiếu thông tin thiết bị cần thiết để hoàn tất yêu cầu."
      },
      "Permissions": {
        "Insufficient": "Bạn không có đủ quyền để thực hiện hành động này."
      },
      "Google": {
        "UserInfoFailed": "Không thể lấy thông tin người dùng từ Google.",
        "CallbackErrorGeneric": "Đã xảy ra lỗi khi đăng nhập bằng Google: {details}. Vui lòng thử lại.",
        "MissingCode": "Thiếu mã ủy quyền từ Google callback.",
        "InvalidToken": "Token xác thực Google không hợp lệ.",
        "InvalidPayload": "Không thể truy xuất thông tin người dùng hợp lệ từ Google.",
        "AccountConflict": "Email này đã được liên kết với một tài khoản Google khác.",
        "AlreadyLinkedToOtherGoogle": "Tài khoản Shopsifu này đã được liên kết với một tài khoản Google khác.",
        "LinkAccountFailed": "Không thể liên kết tài khoản Google. Vui lòng thử lại.",
        "Link": {
          "NoPendingState": "Không tìm thấy yêu cầu liên kết tài khoản Google nào đang chờ. Vui lòng bắt đầu lại quy trình."
        }
      },
      "Verification": {
        "Failed": "Quá trình xác minh đã thất bại. Vui lòng thử lại. Chi tiết: {details}"
      }
    }
  }
}
