{
  "success": {
    "register": {
      "initiate": "Một mã xác minh đã được gửi đến email của bạn. Vui lòng kiểm tra hộp thư đến.",
      "complete": "Đăng ký tài khoản thành công! Chào mừng bạn đến với Shopsifu."
    },
    "login": {
      "success": "Đăng nhập thành công.",
      "2faRequired": "Tài khoản của bạn được bảo vệ bằng xác thực hai yếu tố. Vui lòng nhập mã để tiếp tục.",
      "otpRequired": "Chúng tôi đã gửi một mã xác minh đến email của bạn để xác nhận đăng nhập."
    },
    "logout": {
      "success": "Bạn đã đăng xuất thành công."
    },
    "token": {
      "refreshed": "Làm mới phiên thành công."
    },
    "otp": {
      "sent": "Mã xác thực mới đã được gửi đến email của bạn.",
      "verified": "Xác thực thành công. Bạn có thể tiếp tục.",
      "resend": "Đã gửi lại mã xác thực thành công."
    },
    "password": {
      "initiateReset": "Yêu cầu đặt lại mật khẩu đã được gửi. Vui lòng kiểm tra email của bạn.",
      "resetSuccess": "Mật khẩu của bạn đã được đặt lại thành công.",
      "changeSuccess": "Mật khẩu của bạn đã được thay đổi thành công."
    },
    "2fa": {
      "setupInitiated": "Đã tạo mã QR để thiết lập xác thực hai yếu tố.",
      "setupConfirmed": "Xác thực hai yếu tố đã được kích hoạt thành công. Đừng quên lưu lại các mã khôi phục của bạn.",
      "disabled": "Xác thực hai yếu tố đã được vô hiệu hóa.",
      "recoveryCodesRegenerated": "Mã khôi phục đã được tạo lại thành công."
    },
    "session": {
      "revoked": "Các phiên đã chọn đã được thu hồi thành công.",
      "allRevoked": "Tất cả các phiên đăng nhập đã được thu hồi thành công.",
      "verificationRequired": "Hành động này yêu cầu xác thực. Vui lòng kiểm tra email của bạn.",
      "revokedCount": "Đã thu hồi thành công {count} phiên.",
      "noSessionsToRevoke": "Không có phiên nào để thu hồi.",
      "retrieved": "Lấy danh sách phiên thành công."
    },
    "device": {
      "nameUpdated": "Tên thiết bị đã được cập nhật thành công.",
      "trusted": "Thiết bị này đã được đánh dấu là đáng tin cậy.",
      "untrusted": "Thiết bị này không còn được tin cậy."
    },
    "social": {
      "googleUnlinked": "Tài khoản Google đã được hủy liên kết thành công.",
      "accountNeedsLinking": "Tài khoản của bạn tồn tại nhưng chưa được liên kết với Google. Vui lòng xác thực để hoàn tất liên kết.",
      "successProceedToSecurityChecks": "Xác thực Google thành công. Đang chuyển đến bước kiểm tra bảo mật...",
      "linkSuccess": "Tài khoản Google đã được liên kết thành công.",
      "unlinkSuccess": "Tài khoản Google đã được hủy liên kết thành công.",
      "linkCancelled": "Yêu cầu liên kết tài khoản đã được hủy."
    }
  },
  "error": {
    "serviceUnavailable": "Dịch vụ {serviceName} không khả dụng. Vui lòng thử lại sau.",
    "sltCookieMissing": "Phiên xác thực của bạn đã hết hạn hoặc không hợp lệ. Vui lòng thử lại.",
    "invalidPassword": "Email hoặc mật khẩu không chính xác.",
    "passwordsNotMatch": "Mật khẩu và xác nhận mật khẩu không khớp.",
    "usernameExists": "Tên người dùng '{username}' đã được sử dụng.",
    "emailExists": "Địa chỉ email này đã được đăng ký.",
    "emailNotFound": "Không tìm thấy tài khoản nào với email này.",
    "deviceProcessingFailed": "Không thể xử lý thông tin thiết bị. Vui lòng thử lại.",
    "deviceNotFound": "Không tìm thấy thiết bị được chỉ định.",
    "invalidRefreshToken": "Phiên đăng nhập của bạn đã hết hạn. Vui lòng đăng nhập lại.",
    "missingRefreshToken": "Yêu cầu làm mới phiên không hợp lệ.",
    "insufficientPermissions": "Bạn không đủ quyền để hoàn thành hành động này.",
    "emailMissingInSltContext": "Thiếu thông tin email trong ngữ cảnh xác thực. Vui lòng bắt đầu lại.",
    "invalidOtp": "Mã xác thực không chính xác hoặc đã hết hạn.",
    "otpSendingFailed": "Gửi mã xác thực không thành công. Vui lòng thử lại sau.",
    "tooManyOtpAttempts": "Bạn đã nhập sai mã quá nhiều lần. Vui lòng yêu cầu mã mới.",
    "otpExpired": "Mã xác thực đã hết hạn hoặc không tồn tại. Vui lòng yêu cầu mã mới.",
    "missingNewPasswordInContext": "Mật khẩu mới không có trong ngữ cảnh xác thực.",
    "passwordProcessingFailed": "Lỗi xử lý mật khẩu. Không thể tạo người dùng.",
    "roleConfigurationError": "Lỗi cấu hình vai trò mặc định. Vui lòng đảm bảo vai trò 'Client' tồn tại.",
    "sessionOrDeviceNotFound": "Không tìm thấy phiên hoặc thiết bị được yêu cầu.",
    "invalidRevokeParams": "Yêu cầu thu hồi không hợp lệ. Vui lòng cung cấp ID phiên hoặc ID thiết bị.",
    "emailRequired": "Yêu cầu cần địa chỉ email của người dùng.",
    "invalidDeviceId": "ID thiết bị không hợp lệ.",
    "invalidDeviceName": "Tên thiết bị không hợp lệ.",
    "serverError": "Lỗi máy chủ khi xử lý yêu cầu của bạn.",
    "sessionsNotFound": "Không tìm thấy phiên đăng nhập nào.",
    "invalidPageOrLimit": "Số trang hoặc giới hạn không hợp lệ.",
    "social": {
      "googleCallbackError": "Đã xảy ra lỗi trong quá trình xác thực với Google. Vui lòng thử lại.",
      "pendingLinkTokenMissing": "Không tìm thấy thông tin liên kết tài khoản. Vui lòng bắt đầu lại quá trình.",
      "googleLinkFailed": "Liên kết tài khoản Google không thành công. Vui lòng thử lại.",
      "googleAccountAlreadyLinked": "Tài khoản Google này đã được liên kết với một tài khoản khác.",
      "invalidSocialToken": "Token xác thực từ Google không hợp lệ hoặc đã hết hạn.",
      "googleMissingCode": "Yêu cầu từ Google không hợp lệ (thiếu mã xác thực).",
      "googleInvalidPayload": "Dữ liệu trả về từ Google không hợp lệ hoặc thiếu thông tin cần thiết.",
      "googleUserInfoFailed": "Không thể lấy thông tin người dùng từ Google. Vui lòng thử lại.",
      "notLinked": "Tài khoản của bạn chưa được liên kết với nhà cung cấp này."
    },
    "2fa": {
      "alreadyEnabled": "Xác thực hai yếu tố đã được bật cho tài khoản này.",
      "invalidOtp": "Mã xác thực không hợp lệ hoặc đã hết hạn. Vui lòng thử lại.",
      "notEnabled": "Xác thực hai yếu tố chưa được kích hoạt cho tài khoản này.",
      "invalidRecoveryCode": "Mã khôi phục không hợp lệ hoặc đã được sử dụng.",
      "invalidVerificationMethod": "Phương thức xác minh không hợp lệ."
    },
    "cookieConfigMissing": "Cấu hình cho cookie '{cookieKey}' không tồn tại hoặc không hợp lệ. Vui lòng kiểm tra lại tệp cấu hình.",
    "slt": {
      "invalidPurpose": "Yêu cầu không hợp lệ. Mục đích của hành động không đúng.",
      "expired": "Yêu cầu đã hết hạn. Vui lòng thử lại.",
      "alreadyUsed": "Yêu cầu này đã được sử dụng. Vui lòng bắt đầu lại.",
      "maxAttemptsExceeded": "Bạn đã thử quá nhiều lần. Vui lòng thử lại sau."
    },
    "pendingLink": {
      "invalid": "Liên kết không hợp lệ hoặc đã hết hạn. Vui lòng thử lại."
    },
    "token": {
      "invalidAccessToken": "Token xác thực không hợp lệ hoặc đã hết hạn.",
      "refreshTokenExpired": "Phiên đăng nhập của bạn đã hết hạn. Vui lòng đăng nhập lại.",
      "accessTokenExpired": "Phiên làm việc của bạn đã hết hạn. Vui lòng đăng nhập lại.",
      "missingAccessToken": "Yêu cầu thiếu token xác thực. Vui lòng đăng nhập lại.",
      "missingSessionId": "Token xác thực không hợp lệ (thiếu session ID). Vui lòng đăng nhập lại."
    },
    "session": {
      "revoked": "Phiên đăng nhập của bạn đã bị thu hồi. Vui lòng đăng nhập lại."
    },
    "passwordChangeNotAllowed": "Không thể thay đổi mật khẩu cho tài khoản không có mật khẩu (ví dụ: đăng nhập qua mạng xã hội).",
    "unauthorized": "Bạn không có quyền truy cập tài nguyên này."
  }
}
